[Cues]
Act_E2_1B_CampusB_Birds_Look01_Max_010="The birds are flocking around Samuel..."
Act_E2_1B_CampusB_BrokenWindow_Look01_Max_010="Shit, the window is still broken after I warned Alyssa about the rogue football. One little thing changed the course of that window's life..."
Act_E2_1B_CampusB_CHSamuel_Look01_Max_010="Ah, there's Samuel, up early, already communing with the critters..."
Act_E2_1B_CampusB_CHSquirrel_VoiceOver_Max_010="I better not get near the bench or the squirrel won't take the food."
Act_E2_1B_CampusB_CHTaylor_Look01_Max_010="I don't think I've actually seen Taylor alone without Team Victoria."
Act_E2_1B_CampusB_CHTaylor_Look02_Max_020="Well, that conversation didn't suck. Give peace a chance..."
Act_E2_1B_CampusB_CHWarren_Look01_Max_010="Warren is out and about already too. Looks like he's waiting for somebody..."
Act_E2_1B_CampusB_CHWarren_Look02_Max_020="That boy cracks me up. I'm glad he's on my side."
Act_E2_1B_CampusB_FootBall_Look01_Max_010="Can't Blackwell have at least one "No Football Zone"?"
Act_E2_1B_CampusB_MPA04_Look01_Max_010="I can see that Samuel's concerned but... does he need a poster?"
Act_E2_1B_CampusB_Object01_Look01_Max_010="I've never seen Samuel wearing shades... and what's with this other crap?"
Act_E2_1B_CampusB_Pipe_Look01_Max_010="I definitely won't play with this thing again..."
Act_E2_1B_CampusB_Plaque_Look01_Max_010=""The Prescott Dormitory." Good Lord, Nathan's family owns my dorm?!"
Act_E2_1B_CampusB_RachelPhotos_Look01_Max_010="How did Samuel get photos of Rachel posing?"
Act_E2_1B_CampusB_Scaffolding_Look01_Max_010="The paint job looks great. Samuel knows his color schemes."
Act_E2_1B_CampusB_Squirrel_Interact01_Max_010="Yes! Another Pulitzer for the portfolio!"
Act_E2_1B_CampusB_Squirrel_Look01_Max_010="Wowser, it's hard to get this close to a squirrel..."
Act_E2_1B_CampusB_Tools_Look01_Max_010="Samuel really should keep this locked. It's a waiting accident. And too easy to sneak into..."
Act_E2_1B_CampusB_Totem_Look01_Max_010="Warren told me that totem is named "Tobanga" for a reason nobody knows."
Act_E2_1B_CampusB_TrashFood_Interact01_Max_010="Release the Kraken! Come on squirrels, time for your 15 minutes of fame..."
Act_E2_1B_CampusB_TrashFood_Look01_Max_010="How hard is it to dump the trash into a bin? But I could use this to attract squirrels..."
Act_E2_1B_CampusB_VoiceOver01_VoiceOver_Max_010="I need to get to the main campus and catch the bus. Chloe is waiting at the diner."
Act_E2_1B_CampusB_VoiceOver02_VoiceOver_Max_020="I better go to the main campus so I can take the bus to the diner. Chloe is waiting."
Act_E2_1B_CampusB_VoiceOver03_VoiceOver_Max_030="Blackwell is so serene early in the morning..."
Act_E2_1B_CampusB_VoiceOver04_VoiceOver_Max_040="The campus has a portfolio of image possibilities..."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_001="Hey Samuel, you're up early."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_003="That's one thing I truly love about Arcadia Bay,|it's all those cool animals in the forest."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_007="Don't laugh, but... I saw a doe that seemed to be looking right at me... like it was trying to communicate..."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_015="The usual... You know."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_017="So, what did you think about that freak snow shower yesterday?"
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_021="Sorry to pry, Samuel, but... why are there photos of Rachel Amber in your shed? I'm curious about her..."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_025="But you did?"
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_027="Oh. You talked to the police. Rachel wanted to be a model."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_028="I know people who did. People who are looking for her."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_030="It's no mystery that you have her pictures..."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_034="I so don't want to get in the way of your morning ritual. See you later."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_040="Hello again, Samuel."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_042="So did you know her?"
Cue_E2_1B_CampusB_CHSamuel_Phase01_Max_043="I know people who cared for her. People who are looking for her."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_002="Oh—hello, young Max. I do love the early morning. Everything is so calm and quiet... and I can feel the animals waking up with me."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_004="The squirrels always come in the morning... for food. I can hear them whisper... What animals do you see in the forest?"
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_008="Oh, that's your spirit animal! Nothing weird there, except you saw yours. Could be a sign about your destiny... What do I know? My spirit animal is a squirrel."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_016="Seems like you know more."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_020="Another message from the Earth to get our shit together. I will say that Samuel hasn't seen anything like that before..."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_022=""Sorry to pry" she says while prying. Now everybody wants to know about her."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_026="Like I told the police, she was a good egg. And she gave me those photos."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_029="If she can be found. Like you, that's the nature of mystery."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_031="Yeah. She gave out head shots like squirrels chasing food. Keep on prying, Max. Sounds like you have a lot of time on your hands..."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_035="Of course you will."
Cue_E2_1B_CampusB_CHSamuel_Phase01_Samuel_041="Hello again yourself, Max."
Cue_E2_1B_CampusB_CHSamuel_Phase02_Samuel_001="Take care, Max... and keep listening to the animals."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Max_001="Hi Taylor..."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Max_004="I don't want to fight with you or Victoria. Instead of smacktalk... let's just talk. For once."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Max_006="Kate is really upset about the video... All this gossip is cruel."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Max_008="Why do you hang out with Victoria? She's pretty mean to you and Courtney."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Max_010="I guess I've had mean, bossy best friends too. Better than having mean, bossy parents..."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Max_012="Never mind, Taylor."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Max_014="I've heard that your mother was sick. I'm so sorry. What—what happened to her?"
Cue_E2_1B_CampusB_CHTaylor_Phase01_Max_016="I know. That's why I wanted to talk."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Max_027="Well, sorry to exist, Taylor."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Taylor_002="Why would you even talk to me after the shit you pulled yesterday with Victoria?"
Cue_E2_1B_CampusB_CHTaylor_Phase01_Taylor_003=""Hi Taylor." Just because you were nice to Victoria doesn't mean I have to be nice to you."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Taylor_005="You're funny. Well, I'm not doing anything at the moment... so talk."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Taylor_007="Boo hoo. That's what happens when you preach to everybody about sex. She'll live."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Taylor_009="And she's bossy too! Look, you don't know her. I do. And she's one of the best friends you could have."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Taylor_011="I would love it if my mom was mean or bossy instead of sick... but whatever. We've had our talk."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Taylor_013="That was a great talk, Max. Let's not do it again. Now if you'll excuse me..."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Taylor_015="Well, if you do care... My mom had back surgery. Victoria was there for me. Like you are for Kate. I'm not about tearing people down, Max."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Taylor_017="I'm... glad we did."
Cue_E2_1B_CampusB_CHTaylor_Phase01_Taylor_028="On that we agree. Do you mind? Leaving? Thanks."
Cue_E2_1B_CampusB_CHTaylor_Phase02_Max_001="Taylor?"
Cue_E2_1B_CampusB_CHTaylor_Phase02_Taylor_002="Conversation over."
Cue_E2_1B_CampusB_CHTaylor_Phase03_Max_001="Hi again, Taylor."
Cue_E2_1B_CampusB_CHTaylor_Phase03_Taylor_002="Hey. That wasn't such a bad talk. We should do it again. See you later."
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_002="Warren, what are you doing here?"
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_005="By the way, thank you for stepping in. You were pretty badass, Warren. I owe you."
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_007="That was intense. Everything happened so fast. I owe you."
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_009="You're a real "Everyday Hero." You stood up to a bully and it was awesome."
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_010="An old friend. Chloe Price? We haven't seen each other in a while."
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_015="Just a pirate I used to know."
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_018="I busted him in the bathroom yesterday with a gun. I was too scared to tell Principal Wells. Please don't say anything. I'll give you more info later."
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_022="I busted him in the bathroom yesterday with a gun. I'll give you the story later. Principal Wells is taking care of it now, I hope."
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_028="He's dangerous. I don't want you to get involved. You got me there, but lay low, Nathan Prescott is going to get his karma soon."
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_036="Yes, that's exactly what I need. I love those old-school ape films."
Cue_E2_1B_CampusB_CHWarren_Phase01_Max_040="No, I don't think I can concentrate on going out to the movies. I just feel like escaping."
Cue_E2_1B_CampusB_CHWarren_Phase01_Warren_001="Oh, nothing—waiting. For a call? I mean, I already took the call...|Anyway. I wanted to rap about that action yesterday."
Cue_E2_1B_CampusB_CHWarren_Phase01_Warren_006="Oh yes, you do. I got knocked on my ass by that dick. I'm some personal superhero."
Cue_E2_1B_CampusB_CHWarren_Phase01_Warren_016="I bet you were glad to see her blast up in that truck like a rock star. Which begs the question—why is Nathan Prescott getting psycho on you?"
Cue_E2_1B_CampusB_CHWarren_Phase01_Warren_031="Weird fucking week. Like that bizarro snowfall yesterday. Speaking of dystopia, that drive-in is having a 70's "Planet of the Apes" marathon. Let's "Go Ape!""
Cue_E2_1B_CampusB_CHWarren_Phase01_Warren_037="Well, that was easier than I thought. Cool. I'll text you the info."
Cue_E2_1B_CampusB_CHWarren_Phase01_Warren_041="Fine. Be a damned dirty human. I'll "Go Ape" myself."
Cue_E2_1B_CampusB_CHWarren_Phase01_Warren_044="Even though you left me with said bully and ran off with that girl...She's pretty punk rock, how do you know her?"
Cue_E2_1B_CampusB_CHWarren_Phase02_Warren_001="I have to tell Brooke I'm going with you to the movies instead. I'll text you later?"
Cue_E2_1B_CampusB_CHWarren_Phase03_Warren_001="Uh, I have to see if Brooke wants to go to the drive-in, Max. Maybe I'll see you later."
Cue_E2_1B_CampusB_MeetWarren_IGE_Max_010="Hey Warren, what are you doing here?"
Cue_E2_1B_CampusB_WarrenLoop_Warren_010="Max! Check it out!"
Cue_E2_1B_CampusB_WarrenLoop_Warren_020="Max, get's over here."
Cue_E2_1B_CampusB_WarrenLoop_Warren_030="Max! Come on over here!"
Cue_E2_1B_CampusB_WarrenLoop_Warren_040="What up, Max? How are you?"
